In [1]:
import pandas as pd
import sys

In [2]:
print('Python version ' + sys.version)
print('Pandas version ' + pd.__version__)

Python version 3.5.2 | packaged by conda-forge | (default, Jan 19 2017, 15:41:23) [MSC v.1900 64 bit (AMD64)]
Pandas version 0.22.0

In [3]:
d={'one':[1,1,1,1,1],'two':[2,2,2,2,2],'letter':['a','a','b','b','c']}
df=pd.DataFrame(data=d)

In [4]:
df

  letter  one  two
0      a    1    2
1      a    1    2
2      b    1    2
3      b    1    2
4      c    1    2

In [9]:
letter=df.groupby('letter').sum()
letter.index

Index(['a', 'b', 'c'], dtype='object', name='letter')

In [8]:
letterone=df.groupby(['letter','one']).sum()
letterone

            two
letter one
a      1      4
b      1      4
c      1      2

In [10]:
letterone.index

MultiIndex(levels=[['a', 'b', 'c'], [1]],
           labels=[[0, 1, 2], [0, 0, 0]],
           names=['letter', 'one'])

In [11]:
letterone=df.groupby(['letter','one'],as_index=False).sum()
letterone

  letter  one  two
0      a    1    4
1      b    1    4
2      c    1    2